fio_disk/disk_xfs/log/log_38/sde/fio_randread_08k.log
test: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=24698: Sun Jul 15 03:19:17 2018
   read: IOPS=501, BW=4014KiB/s (4111kB/s)(1024MiB/261210msec)
    slat (nsec): min=1891, max=330444, avg=15736.59, stdev=6268.68
    clat (usec): min=853, max=1185.7k, avg=127522.11, stdev=94630.15
     lat (usec): min=874, max=1185.7k, avg=127538.29, stdev=94630.37
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   27], 10.00th=[   38], 20.00th=[   56],
     | 30.00th=[   73], 40.00th=[   89], 50.00th=[  106], 60.00th=[  124],
     | 70.00th=[  144], 80.00th=[  180], 90.00th=[  245], 95.00th=[  317],
     | 99.00th=[  472], 99.50th=[  542], 99.90th=[  709], 99.95th=[  776],
     | 99.99th=[  961]
   bw (  KiB/s): min= 1648, max=11248, per=99.87%, avg=4008.70, stdev=756.39, samples=522
   iops        : min=  206, max= 1406, avg=501.08, stdev=94.54, samples=522
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.04%, 10=0.45%, 20=2.23%, 50=13.77%
  lat (msec)   : 100=30.28%, 250=43.70%, 500=8.76%, 750=0.69%, 1000=0.06%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.69%, sys=1.63%, ctx=128128, majf=0, minf=159
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=131072,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=4014KiB/s (4111kB/s), 4014KiB/s-4014KiB/s (4111kB/s-4111kB/s), io=1024MiB (1074MB), run=261210-261210msec

Disk stats (read/write):
  sde: ios=128902/6, merge=2029/0, ticks=16554730/3747, in_queue=16561684, util=100.00%